_posts/2012-09-12-baking_pi_l0.html
---
layout: post
title: Baking Pi - Operating Systems Development Lesson 0
tags: [os]
---


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 课时0 简介</a>
<ul>
<li><a href="#sec-1-1">1.1 操作系统</a></li>
<li><a href="#sec-1-2">1.2 汇编代码</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">课时0 简介</h2>
<div class="outline-text-2" id="text-1">

<p>这一介绍性的课时没有太多实践的东西,只是为了解释一下操作系统\汇编代码还有
其他一些重要的基本概念. 急于尝试的同学,可以直接跳过本课时.
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">操作系统</h3>
<div class="outline-text-3" id="text-1-1">

<p>操作系统是一种复杂的程序,用来管理在一台计算机上的各个程序,比如说分配计算
机的CPU时间片,内存资源,其他的硬件资源等等.主流的桌面操作系统一般包括
GNU/Linux, Mac OS X和微软的Windows.其他的一些设备也是需要操作系统的,比如
手机就会使用Android, iOS和Windows Phone这类的系统.<sup><a class="footref" name="fnr-.1" href="#fn-.1">1</a></sup>
</p>
<p>
由于操作系统直接与计算机的硬件交互,所以它需要知道具体硬件的一些信息.为了
方便操作系统可以广泛的应用在各种计算机上, <b>驱动</b> 的概念被引入.驱动的作用
就是为了使操作系统可以方便的与一个特定的硬件设备进行通讯, 它也是一段代码,但
是可以很容易的加入或者移出操作系统.本课程不涉及如何创建这类可移出的驱动,而
仅仅集中于Raspberry Pi相关的设备驱动.
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">汇编代码</h3>
<div class="outline-text-3" id="text-1-2">

<p>本课程的代码基本都是汇编代码.它的特点就是十分接近计算机硬件层,易于被机器
所"理解".计算机的工作是通过处理器和内存来实现的,处理器可以做一些数字的加
减法这类的简单工作,内存则负责存储这些数字.计算机通电后,处理器就通过执行
程序员交给它的指令来改变内存中的数字和与硬件交互.汇编代码就是这些指令被
翻译成方便人类读取的形式.
</p>
<p>
一般编程,程序员都会使用一门编程语言,譬如C++,Java,C#,Basic等等.之后再调用
编译器将这些由程序员编写的代码翻译成为汇编代码,之后会再进一步翻译成为二
进制代码<sup><a class="footref" name="fnr-.2" href="#fn-.2">2</a></sup>.二进制代码是计算机实际能够理解的语言,只不过实在不适合人类阅读.汇
编代码就相对易读,但是供程序员使用的指令也依然很少. 请谨记每个使用汇编代
码编写的指令,都是计算机可以直接理解的,因此这些指令是受下层硬件决定的,每
个指令都会被实际上的电路直接使用.
</p>
<p>
[图片占位符]
</p>
<p>
和一般的上层编程一样,汇编语言也有多种.当然,多样的原因不是像上层语言那样,
而是因为世界上存在多种不同的处理器,每种处理器往往都设计成理解某一个语言.因
此,一个程序员如果用汇编语言给一个机器编写程序,那么不同类的机器就不能够使
用这一程序.一般而言,这种每个不同架构都需要重新编写程序的情况实在是个大灾
难,不过对于操作系统来说,这就无所谓了,因为它本身就要为不同的硬件重新编写.不
过,不是操作系统的所有部分都需要重写,因为操作系统的大部分也是由c++或者c语
言这种上层语言来编写,以方便转化到不同的架构上,需要重写的只是那些必须通过
汇编语言来实现的部分.
</p>
<p>
目前,已经可以进入第一课时了.
</p>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn-.1" href="#fnr-.1">1</a></sup> 更完整的操作系统清单,请参考
  <a href="http://en.wikipedia.org/wiki/List_of_operating_systems"> List of operating systems - Wikipedia, the free encyclopedia</a>
</p>


<p class="footnote"><sup><a class="footnum" name="fn-.2" href="#fnr-.2">2</a></sup> 在这里,对"一般编程"是简化了描述,事实上,它与语言和机器都息息相关,
深入了解,可以参考
<a href="http://en.wikipedia.org/wiki/Compiler"> Compiler - Wikipedia, the free encyclopedia</a>
</p>


</div>
</div>
</div>

</div>
</div>
